In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
%matplotlib inline

c:\Users\Ash\anaconda3\lib\site-packages\scipy\__init__.py:146: UserWarning: A NumPy version >=1.16.5 and <1.23.0 is required for this version of SciPy (detected version 1.24.2
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion}"

In [2]:
aisles = pd.read_csv("Data/aisles.csv")
department = pd.read_csv("Data/departments.csv")
orders = pd.read_csv("Data/orders.csv")
products = pd.read_csv("Data/products.csv")
order_products_prior = pd.read_csv("Data/order_products__prior.csv")
order_products_train = pd.read_csv("Data/order_products__train.csv")

In [3]:
orders.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [4]:
order_products_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [5]:
order_products_train.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [6]:
orders.shape

(3421083, 7)

In [9]:
order_products_prior.shape

(32434489, 4)

In [18]:
order_products_train.shape

(1384617, 4)

In [7]:
order_products = pd.concat([order_products_prior, order_products_train]).sort_values(by=['order_id'])
order_products.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1
5         1       13176                  6          0

In [10]:
orders.order_id.value_counts

<bound method IndexOpsMixin.value_counts of 0          2539329
1          2398795
2           473747
3          2254736
4           431534
            ...
3421078    2266710
3421079    1854736
3421080     626363
3421081    2977660
3421082     272231
Name: order_id, Length: 3421083, dtype: int64>

In [36]:
order_products.order_id.value_counts()

1564244    145
790903     137
61355      127
2970392    121
2069920    116
          ...
1165807      1
463145       1
997201       1
2750695      1
443163       1
Name: order_id, Length: 3346083, dtype: int64

In [13]:
orders[orders.order_id == 2]

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
3355525,2,202279,prior,3,5,9,8.0

In [14]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 7 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   eval_set                object
 3   order_number            int64
 4   order_dow               int64
 5   order_hour_of_day       int64
 6   days_since_prior_order  float64
dtypes: float64(1), int64(5), object(1)
memory usage: 182.7+ MB

In [15]:
order_products_prior.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434489 entries, 0 to 32434488
Data columns (total 4 columns):
 #   Column             Dtype
---  ------             -----
 0   order_id           int64
 1   product_id         int64
 2   add_to_cart_order  int64
 3   reordered          int64
dtypes: int64(4)
memory usage: 989.8 MB

In [8]:
#checking for missing values
total=orders.isnull().sum()
total

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [9]:
#checking for the percentage
percentage=total/orders.isnull().count()
percentage

order_id                  0.000000
user_id                   0.000000
eval_set                  0.000000
order_number              0.000000
order_dow                 0.000000
order_hour_of_day         0.000000
days_since_prior_order    0.060276
dtype: float64

In [10]:
missing_value_table_orders = pd.concat([total,percentage],keys=['Total','Percentage'],axis=1)
missing_value_table_orders

                         Total  Percentage
order_id                     0    0.000000
user_id                      0    0.000000
eval_set                     0    0.000000
order_number                 0    0.000000
order_dow                    0    0.000000
order_hour_of_day            0    0.000000
days_since_prior_order  206209    0.060276

In [15]:
orders_sub=orders[orders['days_since_prior_order'].notnull()]
orders_sub = orders_sub[:100000]

In [16]:
orders_sub.shape

(100000, 7)

In [38]:
orders_sub.to_csv("Orders_Sample1.csv")

In [20]:
#checking for missing values
total=order_products.isnull().sum()
total

order_id             0
product_id           0
add_to_cart_order    0
reordered            0
dtype: int64

In [21]:
order_products_sub = order_products[:100000]
order_products_sub.shape

(100000, 4)

In [22]:
order_products_sub.tail()

       order_id  product_id  add_to_cart_order  reordered
95975     10141       12341                  1          0
95976     10141       28204                  2          0
95977     10141       18891                  3          0
95978     10141       21616                  4          0
95979     10141       47626                  5          0

In [37]:
order_products.to_csv("Order_Products_Sample1.csv")

In [17]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49688 entries, 0 to 49687
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49688 non-null  int64
 1   product_name   49688 non-null  object
 2   aisle_id       49688 non-null  int64
 3   department_id  49688 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [18]:
#checking for missing values
total=products.isnull().sum()
total

product_id       0
product_name     0
aisle_id         0
department_id    0
dtype: int64

In [23]:
#aisles
total_a=aisles.isnull().count()
total_a

aisle_id    134
aisle       134
dtype: int64

In [24]:
percentage_a=total_a/aisles.isnull().count()
percentage_a

aisle_id    1.0
aisle       1.0
dtype: float64

In [25]:
missing_value_table_aisles = pd.concat([total_a,percentage_a],keys=['Total','Percentage'],axis=1)
missing_value_table_aisles

          Total  Percentage
aisle_id    134         1.0
aisle       134         1.0

In [26]:
#departments
total_d=department.isnull().sum()
total_d

department_id    0
department       0
dtype: int64

In [27]:
percentage_d=total_d/department.isnull().count()
percentage_d

department_id    0.0
department       0.0
dtype: float64

In [28]:
missing_value_table_departments = pd.concat([total_d,percentage_d],keys=['Total','Percentage'],axis=1)
missing_value_table_departments

               Total  Percentage
department_id      0         0.0
department         0         0.0

In [29]:
count_hour_of_day=orders_sub['order_hour_of_day'].value_counts()
count_hour_of_day

10    8492
11    8448
13    8260
15    8187
14    8164
12    8125
16    7894
9     7650
17    6666
18    5366
8     5233
19    4088
20    2927
7     2736
21    2242
22    1759
23    1111
6      944
0      596
1      314
5      280
4      184
2      184
3      150
Name: order_hour_of_day, dtype: int64

In [35]:
grouped_orders = orders_sub.groupby(["order_dow", "order_hour_of_day"])["order_number"].aggregate("count").reset_index()
grouped_orders

     order_dow  order_hour_of_day  order_number
0            0                  0           108
1            0                  1            63
2            0                  2            41
3            0                  3            28
4            0                  4            20
..         ...                ...           ...
163          6                 19           538
164          6                 20           338
165          6                 21           308
166          6                 22           272
167          6                 23           178

[168 rows x 3 columns]

In [40]:
orders_sub.tail()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
106443,1558749,6448,prior,7,0,13,4.0
106444,3217413,6448,prior,8,3,11,3.0
106445,1418786,6448,prior,9,5,15,2.0
106446,102304,6448,prior,10,2,13,4.0
106447,1588869,6448,prior,11,2,12,7.0

In [62]:
user_data = pd.DataFrame(orders_sub.user_id)
#user_data = user_data.reset_index()
user_data = user_data.drop_duplicates()
user_data.head()

    user_id
1         1
12        2
27        3
40        4
46        5

In [64]:
import pandas as pd
import random
import string

# define a function to generate a random string of given length
def generate_random_string(length):
    letters = string.ascii_lowercase
    return ''.join(random.choice(letters) for i in range(length))


# generate names and passwords for each user ID
names = [generate_random_string(3).capitalize() for i in range(6448)]
passwords = [generate_random_string(8) for i in range(6448)]

user_data = user_data.assign(name=names, password=passwords)
user_data = user_data.reset_index()
user_data.drop("index",axis = 1)
user_data.head()

   index  user_id name  password
0      1        1  Usi  rojejudx
1     12        2  Afj  mrrabuez
2     27        3  Mpw  pxtqdcbv
3     40        4  Dxz  cfixmtmm
4     46        5  Ssj  mvbraajd

In [65]:
user_data.to_csv("User_Data.csv")